In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    316     98   John  January      Q1
1  2023-01-02       B   West    946     31   Mary  January      Q1
2  2023-01-03       C  North    734     45    Bob  January      Q1
3  2023-01-04       D  South    774     83  Alice  January      Q1
4  2023-01-05       A   East    302     91   John  January      Q1
5  2023-01-06       B   West    790     87   Mary  January      Q1
6  2023-01-07       C  North    392     61    Bob  January      Q1
7  2023-01-08       D  South    223     71  Alice  January      Q1
8  2023-01-09       A   East    331     85   John  January      Q1
9  2023-01-10       B   West    681     56   Mary  January      Q1
10 2023-01-11       C  North    393     88    Bob  January      Q1
11 2023-01-12       D  South    637     91  Alice  January      Q1
12 2023-01-13       A   East    773     24   John  January      Q1
13 2023-01-14       B   West    633     18   Mary  January      Q1
14 2023-01-15       C  North    552     64    Bob  January      Q1
15 2023-01-16       D  South    878     72  Alice  January      Q1
16 2023-01-17       A   East    558     41   John  January      Q1
17 2023-01-18       B   West    530     98   Mary  January      Q1
18 2023-01-19       C  North    389     83    Bob  January      Q1
19 2023-01-20       D  South    819     61  Alice  January      Q1

In [5]:
pd.pivot_table(df, values="Sales", index="Region", columns="Product", aggfunc="median")

Product      A      B      C      D
Region
East     331.0    NaN    NaN    NaN
North      NaN    NaN  393.0    NaN
South      NaN    NaN    NaN  774.0
West       NaN  681.0    NaN    NaN

In [6]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     456.0    NaN    NaN    NaN  67.8   NaN   NaN   NaN
North      NaN    NaN  492.0    NaN   NaN   NaN  68.2   NaN
South      NaN    NaN    NaN  666.2   NaN   NaN   NaN  75.6
West       NaN  716.0    NaN    NaN   NaN  58.0   NaN   NaN